# -*- coding: utf-8 -*-
#                       ДЗ "Модули, пакеты, импорты в Python".
#               Задача №1. Данные сотрудников.

from typing import List, Any

employees_list: List[Any] = [
    ['Андреев', 'менеджер', 35000],
    ['Воробьёв', 'механик', 40000],
    ['Галкина', 'бухгалтер', 38000],
    ['Крылова', 'секретарь', 18000],
    ['Матвеев', 'менеджер', 38000],
    ['Носов', 'электрик', 41000],
    ['Орехов', 'мастер', 28000],
    ['Прокопьев', 'курьер', 22000]
]
print('\nПодключен модуль data.py')
