# -*- coding: utf-8 -*-
#                       "Модули и пакеты. Импорт."
#                   Задача №5. Создать рядом с файлом main.py модуль dirty_main.py
#                              и импортировать все функции с помощью конструкции.
#

import task_4.1.1-3_main


if __name__ == '__main__':
    
    task_4.1.1-3_main.main()
    
    # input('\n  -- Конец --  ')  # Типа  "Пауза" - Для среды
    print('\n  -- Конец --  ')  # - Для блокнота
